const Flower = require('../models/flower.model')

const flowers = [
    new Flower (
         1,
        'Троянда',
        'Мондіаль',
        80,
        35,
        'Білий',
        1,
        4,
        'Троянди завжди випромінювали радість та щастя, це романтичні і неповторні квіти, милували око красунь, ошатно та нарядно красувалися у палацах, урочисто та святково прикрашаючи святкування та помпезні бали. Троянди неперевершені та бездоганні у діловому стилі, даруючи повагу та визнання, вони здатні створити атмосферу свята залишити у думках приємні враження.',
        true,
    ),
    new Flower (
        2,
        'Тюльпан',
        'Дабл',
        50,
        25,
        'помаранчевий',
        40,
        1,
        'Тюльпан дабл - ніжна, весняна квітка. Сорт тюльпанів "дабл" прославився своєю фантастичною формою бутона, багатошаровістю і обсягом. Дивовижно ніжні пелюстки схожі на клаптики шовкової матерії, витончено зібрані в неймовірно красиві бутони. Тюльпани -   чарівні квіти, які широко використовуються в букетах і композиціях, особливо весняних. Дарувати їх можна всім без винятку: яскраві, ефектні - ці квіти здатні порадувати будь-якого цінителя краси.',
        true,
    ),
    new Flower (
        3,
        'Гладіолус',
        '',
        55,
        0,
        'Фіолетовий',
        80,
        2,
        'Гладіолус - благородна квітка з витягнуто-спрямованою на активну форму росту. Ідеально виглядає в класичних композиціях, додаючи букету спрямованість і ексклюзивний стиль. Має багато кольорів, форм і фактур пелюсток. Альтернативне назва гладіолусів - шпажник, чудово характеризує зовнішні характеристики елегантного представника квіткового світу. Мечовидні листя, доповнені розкішними великими суцвіттями, надають гладіолуси войовничий і одночасно благородний вид.',
        false,
    )
]


module.exports = flowers


// в більш просунутому варіанті має бути вибір типу упакування, напр.  packing: ['просте', 'зі стрічкою', 'дизайнерське'],